# -*- coding: utf-8 -*-
BODIES = {
    "sim1.txt": """<c=r>鲁卜哈利沙漠</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 萨那空军基地

<c=g>任务目标：</c> 沿航线飞行并降落于利雅得军事机场

<c=g>武器：</c> 6x LAU-68, 2x AIM-9X, 2x AIM-120C, 2x Mk20

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 06:00:00

沿标定航线飞行，从山地出发，飞越广袤的<u>鲁卜哈利沙漠</u>（空白地带）。沙漠看似毫无地标，但须密切注视空情。

无需加油机，但必须在<u>利雅得军事机场</u>成功着陆。
""",

    "sim2.txt": """<c=r>基什布熔岩原</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 哈立德国王国际机场

<c=g>任务目标：</c> 沿航线飞行并降落于吉达阿卜杜勒·阿齐兹国王国际机场

<c=g>武器：</c> 6x LAU-68, 2x AIM-9X, 2x AIM-120C, 2x Mk20

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 10:00:00

与僚机从利雅得<u>哈立德国王国际机场</u>起飞。沿标定航线飞行，并注意其他航空器。

无需加油机，但必须在吉达<u>阿卜杜勒·阿齐兹国王国际机场</u>成功着陆。
""",

    "sim3.txt": """<c=r>尼罗河</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 埃及艾斯尤特空军基地

<c=g>任务目标：</c> 沿航线飞行并降落于苏丹乌姆杜尔曼空军基地

<c=g>武器：</c> 6x LAU-68, 2x AIM-9X, 2x AIM-120C, 2x Mk20

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 14:00:00

与僚机从<u>艾斯尤特空军基地</u>起飞。沿标定航线飞行，并注意其他航空器。

无需加油机，必须在苏丹<u>乌姆杜尔曼空军基地</u>成功着陆。
""",

    "sim4.txt": """<c=r>喀土穆至塔纳湖</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 乌姆杜尔曼空军基地

<c=g>任务目标：</c> 沿航线飞行并降落于埃塞俄比亚贡德尔空军基地

<c=g>武器：</c> 6x LAU-68, 2x AIM-9X, 2x AIM-120C, 2x Mk20

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 16:00:00

与僚机从<u>乌姆杜尔曼空军基地</u>起飞。沿标定航线飞行，并注意其他航空器。

无需加油机，但必须在埃塞俄比亚<u>贡德尔空军基地</u>成功着陆。
""",

    "sim5.txt": """<c=r>红海门户</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 吉布提国际机场

<c=g>任务目标：</c> 沿航线飞行并降落于亚丁附近阿什沙卜空军基地

<c=g>武器：</c> 6x LAU-68, 2x AIM-9X, 2x AIM-120C, 2x Mk20

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 14:00:00

与僚机从<u>吉布提国际机场</u>起飞。沿标定航线飞行，并注意其他航空器。

无需加油机，但必须在也门南部港口城市亚丁附近的<u>阿什沙卜空军基地</u>成功着陆。
""",

    "sim6a.txt": """<c=r>起飞</c>

<c=g>任务类型：</c> 起飞训练

<c=g>起飞位置：</c> 埃及卢克索机场

<c=g>任务目标：</c> 起飞

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C, 6x Mk20, 6x LAU-68

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 10:00:00

任务开始时，你的飞机停在停机位。从埃及<u>卢克索机场</u>自行起飞。绕场做受控起落航线，并注意其他航空器正在着陆与起飞。自动驾驶系统可代为起飞。

按 [ 与 ] 键启动发动机。开始滑行时，将油门短暂加至 55%，再收至 53%。使用 , 键（向左）与 . 键（向右）操纵前轮转向。可按键盘 SHIFT S 进行<u>时间跳跃</u>，跳至跑道端。

按扩展键盘 + 键将发动机加速至<u>全军用推力</u>（100%）。当空速达到 160 节时，反复按 DOWN CURSOR 键拉起机头，或轻柔后拉驾驶杆。

按键盘 G 收起起落架，保持机翼水平，维持<u>15 度爬升</u>至塔台指示高度，再转入航线。

掌握起飞后，可前往南方较远空域，那里正有战斗空中巡逻（CAP）在防卫埃及领空。
""",

    "sim6engf.txt": """<c=r>发动机故障</c>

<c=g>任务类型：</c> 应急起飞训练

<c=g>起飞位置：</c> 沙特阿拉伯塔伊夫主机场

<c=g>任务目标：</c> 在可能发生发动机故障的情况下起飞

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 12:00:00

任务开始时，你的飞机停在停机位。从沙特阿拉伯圣城麦加附近的<u>塔伊夫主机场</u>起飞。绕场做受控起落航线，并特别注意其他航空器正在着陆与起飞。如需要，自动驾驶系统可代为起飞。

按 [ 与 ] 键启动发动机。按键盘 SHIFT S 进行<u>时间跳跃</u>，跳至跑道端。按扩展键盘 + 键将发动机加速至<u>全军用推力</u>（100%）；当空速达到 180 节时，反复按 DOWN CURSOR 键拉起机头，或轻柔后拉驾驶杆。

按键盘 G 收起起落架，保持机翼水平，维持<u>15 度爬升</u>至塔台指示高度，再转入航线。

<c=r>起飞过程中有随机概率发生单发或双发故障。你必须处置该情况并使飞机安全落地。为此请申请直线进近，然后尝试绕场一周并在指示跑道着陆。</c>
""",

    "sim7a.txt": """<c=r>着陆</c>

<c=g>任务类型：</c> 着陆训练

<c=g>起飞位置：</c> 沙特阿拉伯塔伊夫主机场

<c=g>任务目标：</c> 着陆

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 12:00:00

新手可作直线进近，有经验者可作起落航线进近。自动驾驶可代为着陆。

要在机场着陆必须获得许可。申请进近许可：切换至<u>一号无线电频率</u>（键盘 1），在菜单中选择<u>选项 2</u> AIRFIELD。有把握时选<u>选项 5</u> CIRCUIT APPROACH；新手选<u>选项 3</u> DIRECT APPROACH。

平显此时应处于<u>仪表着陆系统着陆模态</u>（若不是，按 1 选择，或用键盘 H 循环平显模态）。若申请起落航线进近，将获准按标准起落航线进近：JOIN THE LEFT CIRCUIT FOR RECOVERY ON RUNWAY，外加跑道编号。

若申请直线进近，将飞机对准跑道并沿<u>仪表着陆系统指示</u>飞入。机场进近速度应为<u>230 节</u>，至截获仪表着陆系统指示的下滑道时减至<u>170 节</u>（油门 57%）。

保持机翼水平，最迟在下滑道中点放下起落架（键盘 G）。可按键盘 B 放出减速板；接地后该操作同时接通机轮刹车，以获得最短滑跑距离。

将平显速度矢量保持在跑道接地点稍前方（即刚过 3、2、1 跑道标记），直至高度<u>50 英尺</u>，再略微拉起机头，使速度矢量大约指向跑道中段。此时可将油门收至 55%（飞行慢车），以利于接地。

最后进近时须通知塔台：选择无线电频率 PUSH 1。选<u>选项 2</u> Airfield，再从机场菜单选<u>选项 6</u> FINALS。塔台将据此授予最后着陆许可，或指示你复飞绕场。

<c=r>若因战斗损伤必须收起起落架着陆，应尽量保持飞机水平，作非常平缓、低速、低高度的进近。</c>
""",

    "sim7elcf.txt": """<c=r>电气故障</c>

<c=g>任务类型：</c> 应急着陆训练

<c=g>起飞位置：</c> 沙特阿拉伯塔伊夫主机场上空 4,000 英尺

<c=g>任务目标：</c> 在可能发生电气故障的情况下着陆

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 12:00:00

新手可作直线进近，有经验者可作起落航线进近。自动驾驶可代为着陆。

要在机场着陆必须获得许可。申请进近许可：切换至<u>一号无线电频率</u>（键盘 1），在菜单中选择<u>选项 2</u> AIRFIELD。有把握时选<u>选项 5</u> CIRCUIT APPROACH；新手选<u>选项 3</u> DIRECT APPROACH。

平显此时应处于<u>仪表着陆系统着陆模态</u>（若不是，按 1 选择，或用键盘 H 循环平显模态）。若申请起落航线进近，将获准按标准起落航线进近：JOIN THE LEFT CIRCUIT FOR RECOVERY ON RUNWAY，外加跑道编号。

若申请直线进近，将飞机对准跑道并沿<u>仪表着陆系统指示</u>飞入。机场进近速度应为<u>230 节</u>，至截获仪表着陆系统指示的下滑道时减至<u>170 节</u>（油门 57%）。

保持机翼水平，最迟在下滑道中点放下起落架（键盘 G）。可按键盘 B 放出减速板；接地后该操作同时接通机轮刹车，以获得最短滑跑距离。

将平显速度矢量保持在跑道接地点稍前方（即刚过 3、2、1 跑道标记），直至高度<u>50 英尺</u>，再略微拉起机头，使速度矢量大约指向跑道中段。此时可将油门收至 55%（飞行慢车），以利于接地。

最后进近时须通知塔台：选择无线电频率 PUSH 1。选<u>选项 2</u> Airfield，再从机场菜单选<u>选项 6</u> FINALS。塔台将据此授予最后着陆许可，或指示你复飞绕场。

<c=r>若发生电气故障，在系统开始失效时凭判断继续进近并保持下滑道。必须尝试低平进近以实施机腹着陆。</c>
""",

    "sim7hydf.txt": """<c=r>液压故障</c>

<c=g>任务类型：</c> 应急着陆训练

<c=g>起飞位置：</c> 沙特阿拉伯塔伊夫主机场

<c=g>任务目标：</c> 在可能发生液压故障的情况下着陆

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 12:00:00

新手可作直线进近，有经验者可作起落航线进近。自动驾驶可代为着陆。

要在机场着陆必须获得许可。申请进近许可：切换至<u>一号无线电频率</u>（键盘 1），在菜单中选择<u>选项 2</u> AIRFIELD。有把握时选<u>选项 5</u> CIRCUIT APPROACH；新手选<u>选项 3</u> DIRECT APPROACH。

平显此时应处于<u>仪表着陆系统着陆模态</u>（若不是，按 1 选择，或用键盘 H 循环平显模态）。若申请起落航线进近，将获准按标准起落航线进近：JOIN THE LEFT CIRCUIT FOR RECOVERY ON RUNWAY，外加跑道编号。

若申请直线进近，将飞机对准跑道并沿<u>仪表着陆系统指示</u>飞入。机场进近速度应为<u>230 节</u>，至截获仪表着陆系统指示的下滑道时减至<u>170 节</u>（油门 57%）。

保持机翼水平，最迟在下滑道中点放下起落架（键盘 G）。可按键盘 B 放出减速板；接地后该操作同时接通机轮刹车，以获得最短滑跑距离。

将平显速度矢量保持在跑道接地点稍前方（即刚过 3、2、1 跑道标记），直至高度<u>50 英尺</u>，再略微拉起机头，使速度矢量大约指向跑道中段。此时可将油门收至 55%（飞行慢车），以利于接地。

最后进近时须通知塔台：选择无线电频率 PUSH 1。选<u>选项 2</u> Airfield，再从机场菜单选<u>选项 6</u> FINALS。塔台将据此授予最后着陆许可，或指示你复飞绕场。

<c=r>若发生液压故障，继续进近并保持下滑道。起落架与减速板可能失效，须尝试低平进近以实施机腹着陆。</c>
""",

    "sim8a.txt": """<c=r>空中加油</c>

<c=g>任务类型：</c> 空中加油训练

<c=g>起飞位置：</c> 吉布提附近空中

<c=g>任务目标：</c> 加油

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 12:00:00

在吉布提外海拦截加油机，并成功补满油箱。

手动加油需遵循一套程序，本简报无法尽列。但对新手而言，自动驾驶系统可代为加油。

按键盘 4 选择四号无线电频率——此操作同时进入<u>加油平显模态</u>。必须向加油机申请加油许可：选择四号无线电频率（键盘 4）。在左侧菜单选<u>选项 2</u> REFUELER，再选<u>选项 2</u> REFUEL PERMISSION。

当加油机许可并口播：AFFIRMATIVE, WEAPONS AND NOSE COLD，按扩展键盘 0 打开<u>系统多功能显示器</u>，在多功能显示器边框选择 Autopilot，再从自动驾驶选项中选择 Refuel，最后按键盘 A 接通自动驾驶。

与加油机加油管对接后，自动驾驶将自动断开。加油完成后，加油机将口播：DISCONNECT AND PUSH 2。须按键盘 - 略微收油门以断开对接。

所谓 PUSH 2，是指选择开放无线电频率 2，以便与预警机联络。
""",

    "sim10a.txt": """<c=r>视距外 AMRAAM</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 沙特鲁卜哈利沙漠上空 35,000 英尺

<c=g>任务目标：</c> 交战并歼灭敌机

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120R

<c=g>预警机：</c> 有

<c=g>起飞时刻：</c> 16:50:00

你在沙特鲁卜哈利沙漠执行战斗空中巡逻（CAP）、掩护预警机时，30 架敌歼击机越过<u>也门边境</u>。

你受命在最有效的 AMRAAM 导弹射程拦截并歼灭它们。利用 F-22 航电系统建立自动“射击清单”，在<u>视距外空战</u>中交战敌人。
""",

    "sim10b.txt": """<c=r>近距格斗响尾蛇</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 沙特鲁卜哈利沙漠上空 35,000 英尺

<c=g>任务目标：</c> 歼灭敌机

<c=g>武器：</c> 6x AIM-9X

<c=g>预警机：</c> 有

<c=g>起飞时刻：</c> 17:01:00

未能在沙特鲁卜哈利沙漠上空的视距外空战中击落全部敌机后，你必须接近并与余下两架进入格斗，以阻止它们攻击无防护的<u>预警机</u>。

为 AIM-9X 建立射击清单。切记：导弹外挂时，按一次键盘空格键或驾驶杆发射按钮即可发射。当 AIM-9X 为隐身而挂于两具内埋弹舱时，须先按一次空格键将导弹推出弹舱并截获目标。

<c=r>待所选目标上出现方形“锁定框”后再发射导弹。再按一次空格键或按驾驶杆发射按钮即可发射导弹。</c>
""",

    "sim11a.txt": """<c=r>小牛导弹机动目标攻击</c>

<c=g>任务类型：</c> 近距空中支援（CAS）

<c=g>起飞位置：</c> 1,000 英尺接近目标区

<c=g>任务目标：</c> 摧毁敌车队中的硬目标

<c=g>武器：</c> 8x AGM-65G, 2x AIM-9X, 2x AIM-120C

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 10:00:00

侦察无人机已发现一支大型敌车辆纵队。将车辆列入射击清单（按键盘 T 键），或手动指定目标。

利用地形遮蔽隐蔽接敌。在最佳武器射程攻击；或超低空穿越战场，仅在最后时刻“跃升”，待目标车辆进入发射包线后发射武器。

<c=r>首先攻击任何<u>地空导弹</u>，再打击纵队<u>队首</u>与<u>队尾</u>车辆，将其余车辆封闭在中间。</c>
""",

    "sim11b.txt": """<c=r>航炮扫射近距支援</c>

<c=g>任务类型：</c> 近距空中支援（CAS）

<c=g>起飞位置：</c> 1,000 英尺接近目标区

<c=g>任务目标：</c> 摧毁车队中的软目标

<c=g>武器：</c> 仅航炮

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 14:00:00

对桥梁附近车辆实施第二次通过攻击。大部分地空导弹已被清除，可用航炮以多次浅俯冲扫射软皮目标。注意<u>敌攻击直升机</u>。
""",

    "sim12a.txt": """<c=r>捕鲸叉反舰</c>

<c=g>任务类型：</c> 反舰

<c=g>起飞位置：</c> 2,000 英尺接近目标区

<c=g>任务目标：</c> 摧毁护卫舰与运输舰

<c=g>武器：</c> 4x AGM-84A, 2x AIM-9X, 2x AIM-120C, 2x AGM-65G

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 06:00:00

登陆滩头外海，运兵船正在卸载人员物资。

其向海一侧由一艘<u>护卫舰</u>护卫，两翼有各类快攻艇与巡逻艇严密巡逻。登陆场上空还有各型直升机活动。

此次突击的主要目标是<u>运输舰</u>。以一枚<u>捕鲸叉</u>在最佳射程击毁护卫舰，其余捕鲸叉与<u>小牛导弹</u>用于运输舰及随机目标。
""",

    "sim12b.txt": """<c=r>火箭弹攻击</c>

<c=g>任务类型：</c> 反舰

<c=g>起飞位置：</c> 敌登陆场上空 2,000 英尺

<c=g>任务目标：</c> 摧毁敌方舰船

<c=g>武器：</c> 12x LAU-68, 2x AIM-9X, 4x AIM-120C

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 06:00:00

登陆滩头正遭突击气垫船攻击，其母舰与护卫舰在后方支援。

掩护气垫船的是多艘<u>快攻艇</u>。气垫船与快攻艇为主要目标。向这些高速目标俯冲，对各目标实施短点射<u>火箭弹</u>。
""",

    "sim13a.txt": """<c=r>航空炸弹战场遮断</c>

<c=g>任务类型：</c> 战场遮断（BAI）

<c=g>起飞位置：</c> 巴里姆岛疏散机场西北 30 英里

<c=g>任务目标：</c> 摧毁通信设施

<c=g>武器：</c> 12x Mk82F, 6x AIM-120C, 2x AIM-9X

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 10:00:00

目标为交叉路口附近的<u>野战通信站</u>及车辆场。

此前的反辐射导弹（HARM）攻击已清除全部地空导弹，因此可在 10,000 英尺高度接近，以规避轻武器火力。实施<u>俯冲攻击</u>，将炸弹下落线对准通信建筑与装甲目标后再投放。
""",

    "sim13b.txt": """<c=r>激光制导炸弹</c>

<c=g>任务类型：</c> 近距空中支援（CAS）

<c=g>起飞位置：</c> 巴里姆岛疏散机场西北 30 英里

<c=g>任务目标：</c> 摧毁敌装甲

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C, 4x GBU-24

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 14:00:00

敌装甲已在野战补给停驻点周围固守。以中空攻击摧毁该停驻点及坦克。

<c=r>请参阅手册或在线帮助，以掌握 GBU-24 激光制导炸弹的使用方法！</c>
""",

    "sim13c.txt": """<c=r>集束弹药近距支援</c>

<c=g>任务类型：</c> 近距空中支援（CAS）

<c=g>起飞位置：</c> 巴里姆岛疏散机场西北 30 英里

<c=g>任务目标：</c> 摧毁软皮车辆

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C, 6x Mk20, 6x LAU-68

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 16:00:00

敌装甲人员输送车已与装甲共同固守，掩护通往道路交叉口的前线接近路线。实施<u>低空攻击</u>，将炸弹下落线对准目标后再投下全部炸弹，以摧毁软皮车辆。
""",

    "sim14a.txt": """<c=r>反辐射导弹压制防空</c>

<c=g>任务类型：</c> 压制敌防空（SEAD）

<c=g>起飞位置：</c> 利雅得市区以南 18 英里

<c=g>任务目标：</c> 压制地空导弹防御

<c=g>武器：</c> 4x AGM-88, 2x AIM-9X, 6x AIM-120C, 2x AGM-65G

<c=g>预警机：</c> 有

<c=g>起飞时刻：</c> 06:00:00

将对两座机场实施大规模空袭，打击编队接近目标时须压制当地及分散的<u>地空导弹防御</u>。先导护航歼击机将在你与打击编队前方清场。

在<u>护航歼击机及低空打击机上空后方 25,000 英尺</u>接近。

<c=r>消灭任何“开机照射”的地空导弹。</c>
""",

    "sim14b.txt": """<c=r>联合直接攻击弹药遮断</c>

<c=g>任务类型：</c> 打击

<c=g>起飞位置：</c> 利雅得市区以南 18 英里

<c=g>任务目标：</c> 摧毁防空司令部

<c=g>武器：</c> 2x AIM-9X, 2x AIM-120R, 2x JDAM

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 06:00:00

在对两座机场实施大规模空袭之前，须先打击市区<u>防空司令部</u>及通信设施。以隐身在<u>10,000 英尺</u>接近目标区。完成低空接敌后跃升，待武器进入发射包线后投放。
""",

    "sim14c.txt": """<c=r>集束弹药封锁机场</c>

<c=g>任务类型：</c> 机场封锁

<c=g>起飞位置：</c> 利雅得市区以南 18 英里

<c=g>任务目标：</c> 使机场丧失作战能力

<c=g>武器：</c> 6x Mk20, 6x AIM-9X, 6x AIM-120C

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 06:00:00

将对两座机场实施大规模空袭，以低空投掷<u>集束炸弹</u>打击<u>塔台</u>与<u>维修机库</u>。

接近目标时，当地及边境地空导弹防御将被压制。先导护航歼击机将在打击编队前方清场。

以<u>超低空</u>接近，利用地形遮蔽，再穿越机场并投弹。
""",

    "sim15a.txt": """<c=r>电磁控制运用</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 敌方目标以南 55 英里

<c=g>任务目标：</c> 熟悉电磁控制（EMCON）的使用

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 17:40:00

可由飞行员（手动电磁控制）或 F-22 航电系统（自动电磁控制）决定处于五种电磁控制状态中的哪一种。EMCON 1 隐身性最高；EMCON 5 隐身性最低，但可广泛使用雷达与无线电。

电磁控制系统用于决定 F-22 应保持何种隐身程度。自动模态下，F-22 通常以 EMCON 1 航行。当机载系统发现潜在敌情时，将依据双方距离、对方探测系统及可用武器，随对方接近而逐步提高电磁控制等级。

两架敌歼击机将穿越你的航线，随后在前方约<u>55 英里</u>处无意中转向你。请分别以手动与自动电磁控制重复本任务，自行评估其效果。
""",

    "sim15b.txt": """<c=r>红外搜索跟踪运用</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 敌方目标以南 55 英里

<c=g>任务目标：</c> 熟悉红外搜索跟踪（IRST）的使用

<c=g>武器：</c> 6x AIM-9X

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 17:50:00

红外搜索跟踪（IRST）是高灵敏度红外摄像机，可对远距目标变焦放大，并将图像显示于<u>前置多功能显示器</u>。飞行员可据此在远超目视距离上识别目标。

在 EMCON 1 下，红外搜索跟踪成为主要机载搜索与跟踪设备，亦可依据航电远程接收的辐射信号指示潜在目标，因而是高度隐身的目标截获手段。红外搜索跟踪获得的目标信息与其他传感器信息融合，从而使红外空空与空地制导武器均可指示目标。

两架敌歼击机将穿越你的航线，随后在前方约<u>55 英里</u>处无意中转向你。选择手动 EMCON 1，以<u>隐身模态接敌</u>，利用红外搜索跟踪、前置多功能显示器与锁定视角，为 AIM-9X 导弹指示目标。
""",

    "sim16a.txt": """<c=r>目视识别与射击手</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c>

<c=g>任务目标：</c> 实施目视识别与射击手攻击

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 06:10:00

当需要首先对敌机进行<u>目视确认</u>时，采用目视截获攻击方式。这可能发生在相关国家尚未开战、但处于军事对峙或“武力展示”之时。

四架不明航空器转向你的战斗空中巡逻（CAP）。交战规则要求必须先目视识别不明目标方可开火。两架 F-22 保持约 1 英里间隔。你作为长机飞行员必须目视识别接触目标为意图攻击的敌机，同时 2 号机待命，一旦你下令即对后方接触目标开火。

仅你将进入对方目视范围。在将后方目标交给僚机并下令其攻击后，须立即转向交战敌方长机。此战术应能迅速将 2 对 4 的攻击劣势转为 2 对 1 的优势。
""",

    "sim16b.txt": """<c=r>左拖诱饵</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 巴拉尼斯港空军基地以东 20 英里

<c=g>任务目标：</c> 运用左拖诱饵战术

<c=g>武器：</c> 6x AIM-9X

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 06:10:00

左拖诱饵是双机战术：一机充当诱饵并<u>向左飞行</u>。待对方跟随诱饵后，另一机转入其后方实施攻击。

以正确指令命令僚机<u>左拖诱饵</u>，使你得以切入攻击机后方。
""",

    "sim16c.txt": """<c=r>进攻分离</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 沙特鲁卜哈利沙漠上空 10,000 英尺

<c=g>任务目标：</c> 实施进攻分离

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 06:10:00

双机可在战斗散开队形中实施此战术——一机吸引敌方注意，另一机（最好不被发现）绕至后方。

<u>进攻分离</u>可作为<u>目视识别与射击手</u>的后续动作。当长机获得目视接触并下令僚机开火时，敌方会发现长机并转向其。担任射击手的僚机<u>低空且不被探测</u>，再急转爬升至敌机后方。
""",

    "sim17a.txt": """<c=r>左侧夹击</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 阿科达特疏散机场东南 35 英里

<c=g>任务目标：</c> 实施左侧夹击

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 14:05:00

当一机遭受后半球攻击时，向僚机所在一侧的<u>相反方向</u>转弯，从而进一步牵引攻击机，僚机则利落转入其后方，以红外寻的<u>AIM-9X</u>将其击毁。

你必须吸引敌方注意，同时命令僚机交战攻击机。
""",

    "sim17b.txt": """<c=r>防御分离</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 沙特鲁卜哈利沙漠上空 10,000 英尺

<c=g>任务目标：</c> 实施防御分离

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 14:05:00

此机动用于破坏或有效应对数量对等的后方来袭歼击机。

僚机将按你的指令拉高，<u>向上</u>脱离并试图<u>筋斗绕至后方</u>，作为潜在猎物吸引对方注意，并比你更快损失能量。同时，你向相反方向俯冲，再<u>拉起筋斗</u>交战攻击机，重新投入战斗并将空战高度压低以会合僚机。
""",

    "sim22.txt": """<c=r>攻击我的目标</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 沙特鲁卜哈利沙漠上空 8,000 英尺

<c=g>任务目标：</c> 指挥僚机歼灭敌机

<c=g>武器：</c> 6x AIM-9X, 4x AIM-120C, 4x AIM-120R

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 06:25:00

你在沙特鲁卜哈利沙漠执行战斗空中巡逻（CAP）时，16 架歼击机越过也门边境。

你必须利用航电与相应指令，指挥僚机在最佳<u>AMRAAM</u>导弹射程拦截并歼灭它们。
""",

    "sim24a.txt": """<c=r>攻击敌机</c>

<c=g>任务类型：</c> 近距空中支援（CAS）

<c=g>起飞位置：</c> 卢克索上空 5,000 英尺

<c=g>任务目标：</c> 摧毁地面目标，同时由僚机交战敌机

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C, 12x AGM-65G

<c=g>预警机：</c> 有

<c=g>起飞时刻：</c> 06:05:00

在此次近距空中支援（CAS）任务中，使用你与僚机的武器，交战杀伤盒内的战场威胁。

战场空域目前并不安全，须注视传感器以防敌机，并指挥僚机应对任何威胁。
""",

    "sim24b.txt": """<c=r>战斗巡逻拦截</c>

<c=g>任务类型：</c> 预警机

<c=g>起飞位置：</c> 预警机内

<c=g>任务目标：</c> 重新分配战斗空中巡逻（CAP）任务以歼灭来袭敌机

<c=g>武器：</c> N/A

<c=g>预警机：</c> 有

<c=g>起飞时刻：</c> 06:01:00

须重新分配战斗空中巡逻（CAP）任务以拦截任何敌机：用<u>鼠标左键</u>将歼击机拖至敌机后松开。可通过<u>单击并拖动</u><u>战斗空中巡逻中心点</u>，将巡逻转移至新位置。

<u>左键单击</u>任意航空器图标，即可在左侧面板三维窗口中查看该机。

对预警机地图上的 F-22 图标<u>双击</u>，即可进入你所能看到的任何尚未交战的 F-22 座舱。在未交战情况下，按键盘<u>ESC</u>可从 F-22 返回预警机。
""",

    "sim25.txt": """<c=r>攻击敌对目标</c>

<c=g>任务类型：</c> 战场遮断（BAI）

<c=g>起飞位置：</c> 巴里姆岛疏散机场西北 30 英里

<c=g>任务目标：</c> 在飞毛腿发射车开火前发现并摧毁之

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C, 6x Mk20, 6x AGM-65G

<c=g>预警机：</c> 有

<c=g>起飞时刻：</c> 22:50:00

在此次战场遮断（BAI）任务中，使用你与僚机的武器，在预警机指示区域内发现并交战<u>飞毛腿导弹发射车</u>。
""",

    "sim26.txt": """<c=r>目视识别</c>

<c=g>任务类型：</c> 预警机

<c=g>起飞位置：</c> 预警机内

<c=g>任务目标：</c> 引导航空器目视识别不明接触目标

<c=g>武器：</c> N/A

<c=g>预警机：</c> 有

<c=g>起飞时刻：</c> 12:00:00

当有（橙色）不明航空器接近你的责任空域时，用<u>鼠标左键</u>将最近的歼击机<u>拖动</u>至该不明目标并松开，令其<u>目视识别</u>入侵者。

若将歼击机指向已知敌机（红色），即是命令其拦截。将航空器单击拖向另一航空器是依上下文而定的操作——将己方歼击机拖向己方打击机，即是命令其护航。

将己方歼击机拖向己方加油机，仅在该机已申请加油时才会批准加油，否则将护航该加油机。

<u>左键单击</u>任意航空器图标，即可在左侧面板三维窗口中查看该机。

对预警机地图上的 F-22 图标<u>双击</u>，即可进入你所能看到的任何尚未交战的 F-22 座舱。在未交战情况下，按键盘<u>ESC</u>可从 F-22 返回预警机。
""",

    "sim27.txt": """<c=r>打击编队加油</c>

<c=g>任务类型：</c> 预警机

<c=g>起飞位置：</c> 预警机内

<c=g>任务目标：</c> 引导打击编队加油

<c=g>武器：</c> N/A

<c=g>预警机：</c> 有

<c=g>起飞时刻：</c> 06:04:00

打击任务将在几乎不受敌方空中力量抗击的情况下突击目标，并在突击前按计划加油。计划内加油无需向你请示。但脱离目标后，它们将口头申请额外加油。可用<u>鼠标左键</u>将打击机<u>拖动</u>至最近的己方加油机并松开，以批准其申请。

<c=r>若打击机回答<u>Negative</u>，则其燃油不足以抵达该加油机。</c>

将歼击机拖向加油机，仅在该机已申请加油时才会赋予加油任务，否则它将前去护航加油机。<u>左键单击</u>任意航空器图标，即可在左侧面板三维窗口中查看该机。

对预警机地图上的 F-22 图标<u>双击</u>，即可进入你所能看到的任何尚未交战的 F-22 座舱。在未交战情况下，按键盘<u>ESC</u>可从 F-22 返回预警机。
""",

    "sim30.txt": """<c=r>埃塞俄比亚</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 贡德尔空军基地

<c=g>任务目标：</c> 沿航线飞行并降落于吉布提国际机场

<c=g>武器：</c> 6x LAU-68, 2x AIM-9X, 6x AIM-120C, 2x Mk20

<c=g>预警机：</c> 无

<c=g>起飞时刻：</c> 10:00:00

与僚机从<u>贡德尔空军基地</u>起飞。沿标定航线飞行，并注意其他航空器。

无需加油机，必须在<u>吉布提国际机场</u>成功着陆。
""",

    "sim31.txt": """<c=r>绞磨战术</c>

<c=g>任务类型：</c> 战斗空中巡逻（CAP）

<c=g>起飞位置：</c> 乌姆杜尔曼以南 75 英里、高度 38,000 英尺

<c=g>任务目标：</c> 以绞磨战术歼灭优势敌机

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C

<c=g>预警机：</c> 有

<c=g>起飞时刻：</c> 16:25:00

美国空军采用一种称为<u>绞磨战术</u>的战法：一个歼击机编队机动后，对优势敌方齐射远程导弹，随即迅速盘旋下降，或脱离或重新集结以实施下一次攻击。

该战法可最大化成功概率、降低损失风险，并可反复实施，直至全部敌方被歼灭。

你的战斗空中巡逻（CAP）正被一支远占优势、以摧毁你方<u>预警机</u>为任务的歼击机部队迅速接近。成功的最大把握在于运用绞磨战术歼灭敌人，或至少扭转兵力对比。
""",

    "sim32.txt": """<c=r>隐身突袭</c>

<c=g>任务类型：</c> 斩首

<c=g>起飞位置：</c> 达洛尔空军基地上空 10,000 英尺

<c=g>任务目标：</c> 隐身接敌并在未被探测的情况下摧毁敌运输机

<c=g>武器：</c> 2x AIM-9X, 6x AIM-120C

<c=g>预警机：</c> 有

<c=g>起飞时刻：</c> 06:05:00

隐身是重大资产。若本国政府希望除掉某些特定人物，同时避开其他交战方不受欢迎的关注，隐身尤为有用。

你的任务是拦截运载<u>独裁者</u>的运输机，<u>不预先警告、且不给其发出“Mayday”的机会</u>将其摧毁。避开护航歼击机、其他空中交通以及一触即发的地空导弹。
""",

    "sim34.txt": """<c=r>投放</c>

<c=g>任务类型：</c> 遮断

<c=g>起飞位置：</c> 利雅得以南 60 英里、高度 8,000 英尺

<c=g>任务目标：</c> 摧毁目标并指挥僚机清除地空导弹与随机目标

<c=g>武器：</c> 2x JDAM, 2x AIM-120C, 2x AGM-88, 4x AIM-9X, 3x AGM-65G

<c=g>预警机：</c> 有

<c=g>起飞时刻：</c> 06:00:00

在成功将 JDAM 投向利雅得市区目标的同时，指挥僚机清除地空导弹与随机目标。
""",

    "sim35.txt": """<c=r>隐蔽行动</c>

<c=g>任务类型：</c> 预警机

<c=g>起飞位置：</c> 预警机内

<c=g>任务目标：</c> 引导歼击机清除针对隐蔽直升机任务的威胁

<c=g>武器：</c> N/A

<c=g>预警机：</c> 有

<c=g>起飞时刻：</c> 18:00:00

隐蔽任务将在进入对方空域前加油；歼击机清场将越境并以隐身手段处理任何歼击机与雷达。F-22 歼击机清场将以<u>EMCON 1</u>作战，并接收预警机数据以应对<u>地空导弹以外</u>的任何威胁。在进入其自身传感器作用距离之前，它们依赖你提供拦截引导。

<u>左键单击</u>任意航空器图标，即可在左侧面板三维窗口中查看该机在世界中的影像。

对预警机地图上的 F-22 图标<u>双击</u>，即可进入你所能看到的任何尚未交战的 F-22 座舱。在未交战情况下，按键盘<u>ESC</u>可从 F-22 返回预警机。
""",
}
